{
  "QJOioY": {
    "title": "PowerPort",
    "content": "De Private Power Port is een oerdegelijk, mooie carport met maximale stroomopbrengst, waarbij de panelen functioneren als dak. Enorm gevraagd nu er steeds meer hele woningen op elektra worden verwarmd en er elektrisch wordt gereden. De vraag naar stroom van eigen erf neemt snel toe. Wij helpen u hier graag in.",
    "image": "/public/images/powerport/zonneveranda-berkel-6-1.jpg"
  },
  "keKTrW": {
    "title": "Maximale",
    "subtitle": "stroomopbrengst",
    "image": "/public/images/powerport/img_3071-3-.png",
    "content": "De Private Power Port is gericht op maximale stroomopbrengst. Het gehele dak bestaat uit moderne zwarte zonnepanelen met alle bijbehorende componenten voor de hoge stroomopbrengst met minimale lichtdoorlatendheid.\n\nU kunt ook kiezen voor glas/glas panelen met een beetje lichtdoorlatendheid, zonder dat u vermogen verliest."
  },
  "ahJKPK": {
    "title": "Unieke",
    "subtitle": "constructie",
    "content": "De constructie is geheel anders dan onze ZonneVeranda. Wij maken hem van stevige massief eiken balken uit Frankrijk of verstevigd aluminium. Dit doen wij omdat het meestal een vrijstaande constructie wordt en wij het belangrijk vinden dat deze staat als een huis, zonder verder noodzakelijke ondersteuning of verbindingen met uw woning. Ook is het niet ondenkbaar dat er onder een carport wel eens een bumper in contact kan komen met een staander, daarom hebben wij hem zo zwaar en degelijk ontworpen. Voor uw veiligheid en de levensduur.",
    "image": "/public/images/powerport/img_3083-3-.png"
  },
  "bpTsYs": {
    "title": "Veel",
    "subtitle": "zijdig",
    "content": "Een Private Power Port levert u dubbel voordeel op…\n\nWij bouwen ze met 9, 12 tot zelfs wel 30 panelen als dak. Dat geeft pas echt power van eigen terrein! Power Ports tot 12.000Wp (ook grotere PowerPorts zijn voor ons geen probleem).\n\nDaarnaast is het ook een voordeel dat uw auto, droog, koel en schoner blijft. Sommige klanten maken er deels een extra opslag van…\n\nHet kan bij ons allemaal!",
    "image": "/public/images/powerport/IMG_8858.jpg"
  },
  "x5plqz": {
    "title": "Downloads",
    "content": "Hieronder kunt u de brochures en datasheets downloaden.",
    "downloads": [
      {
        "label": "Brochure - PowerPort",
        "file": "/downloads/Brochure - Powerport.pdf"
      },
      {
        "label": "Datasheet - Bauer",
        "file": "/downloads/Datasheet - Bauer.pdf"
      }
    ]
  },
  "pkrlfd": {
    "title": "Neem contact op",
    "content": "U kan ook contact met ons opnemen via het contactformulier op de contact pagina.",
    "phone": "+31 (0)10 262 16 23",
    "email": "info@zonnevaranda.nl",
    "address": {
      "street": "Weg en Bos",
      "number": "19",
      "postal": "2661 DG",
      "city": "Bergschenhoek"
    }
  },
  "xlbojc": [
    {
      "image": "/public/images/powerport/IMG_1850.jpg"
    },
    {
      "image": "/public/images/powerport/ZonneVeranda Low Res-22.jpg"
    },
    {
      "image": "/public/images/powerport/ZonneVeranda Low Res-26.jpg"
    }
  ]
}
