{
  "oxmine": "## Identiteit en contact gegevens\n\nPrivate-Energy / ZonneVeranda, onderdeel van Groengedacht B.V.\n\n### Verzamelen en gebruiken van persoonsgegevens van klanten, leveranciers en andere opdrachtnemers\n\nGraag maken wij u er op attent dat wij de persoonsgegevens die u ons verstrekt zullen verzamelen en gebruiken omdat dit noodzakelijk is om een eventuele overeenkomst met u te sluiten en uit te voeren. Dat geldt zowel voor onze (potentiële) klanten als voor partijen bij wie wij zaken en/of diensten inkopen. Bent u een (potentiële) klant van ons, dan gebruiken wij uw gegevens om u informatie en/of een offerte te kunnen toesturen, te kunnen bepalen aan welke specificaties of wensen een bepaalde zaak of dienst dient te voldoen, zaken te kunnen leveren of werkzaamheden voor u te kunnen verrichten, te kunnen factureren en met u vlot en efficiënt te kunnen communiceren over de uitvoeringsaspecten van de overeenkomst. Bent u een (potentiële) leverancier of andere opdrachtnemer dan zijn uw persoonsgegevens eveneens noodzakelijk voor de sluiting en uitvoering van de overeenkomst. Bij inkoop is dat nodig om u te kunnen laten weten aan welke specificaties of wensen een bepaalde zaak of dienst wat ons betreft dient te voldoen, een offerte-aanvraag te kunnen toesturen of een bestelling bij u te kunnen plaatsen, uw facturen te kunnen betalen en vlot en efficiënt met u te kunnen communiceren over andere aspecten van de overeenkomst. U bent niet verplicht om ons uw persoonsgegevens te verstrekken. Als u ons geen of onvoldoende persoonsgegevens verstrekt, dan is het echter wel mogelijk dat wij aan de hiervoor genoemde werkzaamheden geen uitvoering kunnen geven.\n\n### Doorgifte aan derden\n\nIn verband met de uitvoering van een eventuele overeenkomst met u is het mogelijk dat wij uw persoonsgegevens moeten verstrekken aan partijen die onderdelen, materialen en producten aan ons toeleveren of in onze opdracht werkzaamheden uitvoeren. Verder maken wij gebruik van externe serverruimte voor de opslag van (delen van) onze verkoop- en inkoopadministratie, waar uw persoonsgegevens een onderdeel van uitmaken. Uw persoonsgegevens worden om die reden aan onze provider van serverruimte verstrekt. Verder maken wij gebruik van een CRM pakket en de bijbehorende opslagmogelijkheden voor e-mails en andere bestanden. Omdat wij gebruik maken van een nieuwsbrief mailing dienst, worden uw persoonsgegevens tot slot doorgegeven aan de aanbieder van deze dienst.\n\n### Direct marketing\n\nAls u ons daarvoor toestemming heeft gegeven, zullen wij de door u opgegeven persoonsgegevens bewaren en gebruiken om u in de toekomst persoonlijk per e-mail op de hoogte te brengen van onze bestaande en nieuwe producten en diensten en u hier eventueel een aanbieding voor te doen. Iedere keer dat wij u een reclamemailing sturen, heeft u de mogelijkheid ons te laten weten hier geen prijs meer op te stellen. Zie hiervoor de afmeldlink onderaan iedere mailing.\n\n### Bewaarperiode persoonsgegevens\n\nIndien u een offerte bij ons heeft opgevraagd maar u geen klant bij ons geworden bent, zullen wij uw gegevens uiterlijk één jaar na ons laatste contact verwijderen. Ook indien wij een offerte van u hebben ontvangen, maar wij geen klant van u zijn geworden, zullen uw persoonsgegevens uiterlijk één jaar na ons laatste contact worden verwijderd. Bent u wel klant bij ons geworden of wij bij u, dan zullen wij uw persoonsgegevens bewaren voor de duur van vijftien jaar na het einde van het boekjaar waarin de overeenkomst met u volledig is uitgevoerd. Binnen deze periode van 15 jaar kunnen wij u dan een optimale serviceverlening bieden en de informatie omtrent uw project terugvinden.\n\n### Uw rechten\n\nU heeft het recht om ons te vragen om uw eigen persoonsgegevens te mogen inzien. Als daartoe aanleiding bestaat, kunt u ons ook verzoeken om aanvulling van uw persoonsgegevens of om het wijzigen van onjuistheden. Daarnaast heeft u het recht om te vragen om uw persoonsgegevens te wissen of het gebruik van uw persoonsgegevens te beperken. Ook kunt u bij ons bezwaar maken tegen het verzamelen en gebruiken van uw gegevens of een klacht indienen bij de Autoriteit Persoonsgegevens. Tot slot kunt u ons verzoeken om verkrijging van uw persoonsgegevens of overdracht van die gegevens aan een ander. Om uw rechten te kunnen uitoefenen kunt u zich wenden tot: Duco Wiersma, Weg en Bos 19, 2661 DG, Bergschenhoek, [+31 (0)10 262 16 23](tel:310102621623), [info@zonnevaranda.nl](mailto:info@zonneveranda.nl). Ook met vragen of voor meer informatie over het verzamelen en gebruiken van uw persoonsgegevens kunt u uiteraard contact met ons opnemen.",
  "hszozc": {
    "title": "Privacyverklaring "
  }
}
