{
  "eCJfhu": {
    "title": "ZonneVeranda",
    "content": "De door ons ontwikkelde ZonneVeranda is een stijlvolle en beschutte verrijking van uw tuin én een continue stroomopwekker voor uw woning of overdekte plek. Een sfeervolle plek die uw elektra rekening drukt de komende 20 jaar. Oog voor detail, jarenlange ervaring en het hoge afwerkingsniveau zorgen ervoor dat u blijft genieten. Eigenlijk een comfortabele aanvulling voor elk seizoen.",
    "image": "/public/images/zonneveranda/ZonneVeranda.jpg"
  },
  "mH4vwS": {
    "title": "Multipurpose",
    "subtitle": "energie opwekker",
    "image": "/public/images/zonneveranda/mlk_7973.jpg",
    "content": "Onze unieke in Europa geproduceerde maatwerk zonnepanelen zijn ruim 310 bij 80cm breed uit één geheel. Zo krijgt u een ZonneVeranda zonder dwarsprofielen. Dit voorkomt lekkage en oogt veel rustiger. U kunt kiezen uit 2 door ons ontwikkelde varianten, 50% of 27% lichtdoorlatendheid. Hoe minder licht een paneel door laat, hoe meer stroom deze opwekt. 50% = 260Wp per paneel, 27% = 395Wp per paneel. Bij beide varianten is een additionele zonwering veelal bewezen niet nodig. Hierdoor bespaart u een dure zonwering."
  },
  "tfYY7G": {
    "title": "Stijlvol en",
    "subtitle": "stevig",
    "image": "/public/images/zonneveranda/1.webp",
    "content": "Onze ZonneVeranda's worden gebouwd van hoogwaardige houtsoorten of aluminium, waarbij kwaliteit, levensduur en uitstraling de norm zijn. Het materiaal zal vrijwel nooit vervormen of torderen en de ruimere maten geven het geheel een fraai beeld. De montage door ons eigen ervaren team staat garant voor een uitstekend eindresultaat. Door ervaring en een goed beproefd concept worden de meeste ZonneVeranda's in slechts één montage dag opgeleverd."
  },
  "hHmIeC": {
    "title": "Uw",
    "subtitle": "voordelen",
    "image": "/public/images/zonneveranda/1.png",
    "content": "* Verlaging energielasten\n* Stijlvolle, droge vierkante meters toegevoegd aan uw tuin\n* Stijging energielabel en meerwaarde woning\n* Nooit meer slepen met tuinmeubilair of de BBQ\n* 25 jaar of langer goedkope stroom voor uw gezin, auto of warmtepomp\n* Gebouwd door een firma met 20 jaar ervaring in deze branche"
  },
  "vvky9h": [
    {
      "image": "/public/images/zonneveranda/Outside - 1.png"
    },
    {
      "image": "/public/images/zonneveranda/IMG_9173.jpg"
    },
    {
      "image": "/public/images/zonneveranda/Outside - 2.png"
    },
    {
      "image": "/public/images/zonneveranda/Carousel.png"
    }
  ],
  "rf8zv3": {
    "title": "Downloads",
    "content": "Hieronder kunt u de brochures en datasheets downloaden.",
    "downloads": [
      {
        "label": "Brochure - ZonneVeranda",
        "file": "/downloads/Brochure - Zonneveranda.pdf"
      },
      {
        "label": "Datasheet - 48 cells",
        "file": "/downloads/Datasheet - 48 cells.pdf"
      },
      {
        "label": "Datasheet - 72 cells",
        "file": "/downloads/Datasheet - 72 cells.pdf"
      }
    ]
  },
  "uqofke": {
    "title": "Neem contact op",
    "content": "U kan ook contact met ons opnemen via het contactformulier op de [contact](http://localhost:3000/contact) pagina.",
    "phone": "+31 (0)10 262 16 23",
    "email": "info@zonnevaranda.nl",
    "address": {
      "street": "Weg en Bos",
      "number": "19",
      "postal": "2661 DG",
      "city": "Bergschenhoek"
    }
  }
}
