{
  "demo": "https://kruidenpower.nl/",
  "thumbnail_cover": "/public/images/projects/kruidenpower-thumbnail.webp",
  "thumbnail_video": "/public/images/projects/kruidenpower-thumbnail.mp4",
  "title": "Kruidenpower",
  "video": "/public/videos/projects/kruidenpower.mp4",
  "short": "Kruidenpower is a website showcasing the herbal medicine business of Nicole Trompetter. I used Nuxt 3, hosted on Netlify, and integrated Decap for content management. A great learning opportunity that allowed me to refine my skills and develop a better understanding of non-interactive websites.",
  "categories": [
    "Design",
    "Development"
  ],
  "description": "Kruidenpower is a website that showcases the herbal medicine business of [Nicole Trompetter](https://nicoletrompetter.nl/), designed by [Lanxiang Vermeulen](https://lxframes.com/). I expand the designs to include mobile devices. I should also thank [Raphael Kurun](https://www.linkedin.com/in/raphael-kurun-776766161) for matching me up with Nicole Trompetter. I found working on this website to be an exciting and informative experience, despite alternative medicine not being something I would typically use.\n\nKruidenpower was also the first job I undertook as a ZZP'er, and it proved to be a crucial learning opportunity. During the project, I experimented with various platforms and technologies, leading me to discover my preferred technology stack for non-interactive websites. Ultimately, I settled on Nuxt 3, which I hosted on [Netlify’s platform](https://www.netlify.com/). I also integrated [Decap](https://decapcms.org/) to streamline content management.\n\nI appreciate the simplicity of Nuxt 3 for somewhat static sites such as Kruidenpower. While it may not be suitable for more complex websites or applications requiring authentication, it was perfect for this project!\n\nIn addition to Kruidenpower, I also created a portfolio for Nicole Trompetter. Although it was a small website, it was a pleasure to work on. However, I felt that it didn't adequately showcase my skills, so I decided not to include it in my portfolio.\n\nOverall, working on Kruidenpower and Nicole Trompetter’s portfolio was a fulfilling experience that allowed me to refine my skills and develop a better understanding of my preferred technology stack for non-interactive websites. Working with Lanxiang Vermeulen was also a great experience, and their contribution to the project was invaluable.",
  "deliverable": "/public/downloads/rmdd.pdf"
}