{
  "title": "Melted",
  "categories": [
    "Development"
  ],
  "thumbnail_cover": "/public/images/projects/melted-thumbnail.webp",
  "thumbnail_video": "/public/images/projects/melted-thumbnail.mp4",
  "video": "/public/videos/projects/melted.mp4",
  "demo": "https://schotsl.github.io/HvG/",
  "short": "A 2D multiplayer puzzle game created by college students. Join forces with a friend to solve the mystery of melted ice cream and find a missing kid in Melted. Discover the excitement and joy of creating a passion project with friends.",
  "description": "Melted is still one of my absolute favourite projects. In the last 3 weeks of my first year of secondary vocational education CMD, we were given the opportunity to create a passion project. It could be anything we wanted. I teamed up with [Tim van Ingen](https://oege.ie.hva.nl/~ingent/Portfolio/) and [Sena Nur Korkutan](https://www.linkedin.com/in/sena-nur-korkutan-83bb09210/), and we decided we would create a 2D multiplayer puzzle game.\n\nIn Melted, you try to solve the mystery of the melted ice cream by finding clues and solving puzzles with your co-op player to figure out where a missing kid has gone. The game was written in [Unity](https://unity.com/) using C#. We wrote almost all the logic ourselves, including the movement, collision, navigation, and multiplayer protocols.\n\nThe best part of the project was designing the multiplayer protocol. I used websockets and [Deno Deploy](https://deno.com/deploy) to run everything and learned a lot about optimising ping times and communication. The night before we had to show our work, Tim van Ingen and I decided to squash a few bugs. Then, as you might expect, 11 PM became 1 AM, 1 AM became 3 AM, and before we knew it, we had to hop on the bus without a single hour of sleep.\n\nOn the bus, I rushed out an Android build for people to play, and we also created a web build. When we tried to demo our game at school for a prize, we ran into a major problem. The WiFi connection was very slow, causing our game to completely bug out. I had never tested the system on a slow connection, and I still think back to that day and how I could have started the server on my local laptop, and everything would have worked fine. Hindsight is 20/20.\n\nWe ended up getting third place in the competition. I still think we could’ve made first place without the multiplayer problems. Nonetheless, I loved every hour of working on Melted, and I couldn't have asked for a better team. I'm not that interested in developing games, but the experience was absolutely amazing!"
}