{
  "github": "https://github.com/Schotsl/Presently-deploy",
  "thumbnail_cover": "/public/images/projects/presently-thumbnail.webp",
  "thumbnail_video": "/public/images/projects/presently-thumbnail.mp4",
  "title": "Presently",
  "video": "/public/videos/projects/presently.mp4",
  "short": "Discover how I developed Presently, a cost-effective solution for displaying PowerPoints on TV screens. Collaborating with Wouter de Bruijn. Explore Presently's features and potential uses for small businesses.",
  "categories": [
    "Development"
  ],
  "description": "My mother, who runs an [international primary school](https://www.optimist-international-school.nl/), wanted to install a TV in the hallway to keep parents and students informed about school-related information. She had approached a few services, but they all turned out to be too expensive. So, she asked me if I could develop software to run on the screen that would allow her to upload PowerPoints. I teamed up with [Wouter de Bruijn](http://wouterdebruijn.nl/), and he developed a [Nuxt](https://nuxtjs.org/) frontend for the software while I focused on creating a [Node](https://nodejs.org/en/) application that ran on Windows to control PowerPoint.\n\nWe set up the software for my mother, and everything seemed great for the first day. However, it turned out that running PowerPoint on Windows was quite unstable, with frequent pop ups and update requests. To address this, I rewrote the application in [.NET](https://dotnet.microsoft.com/en-us/) with C#, which allowed me to tap into the PowerPoint API and stabilise the software somewhat. However, I wasn't satisfied with the solution yet.\n\nAfter some brainstorming, I came up with a system where PowerPoints get uploaded to [DigitalOcean Spaces](https://www.digitalocean.com/products/spaces) and [CloudConvert](http://cloudconvert.com/), which then turns the PowerPoint into a bunch of pictures. The displays in the school all run a stripped-down version of [Raspbian](https://www.raspbian.org/), with a [Deno](https://deno.land/) application that downloads and displays the slides. This solution made the displays very stable. I should once again thank Wouter de Bruijn for setting up the stripped-down Raspbian, configuring the Raspberry Pi’s and managing the VPN’s.\n\nPresently allows you to upload, delete, and replay PowerPoints on all or specific displays with a customised interval, pause/play functionality, and live preview. While I am still working on the frontend (see [RMDD](http://https//sjorsvanholst.nl/rmdd/)), I am very proud of what I have accomplished so far.\n\nThis project has taught me a lot about managing expenses, thinking through a project, and time management. Once I complete the frontend, I hope to start selling Presently as a service to small businesses. It is currently being used for it's intended purposes at Optimist International School."
}