{
  "title": "Ticketmain",
  "video": "/public/videos/projects/ticketmain.mp4",
  "thumbnail_video": "/public/images/projects/ticketmain-thumbnail.mp4",
  "thumbnail_cover": "/public/images/projects/ticketmain-thumbnail.webp",
  "categories": [
    "Development"
  ],
  "github": "https://github.com/Schotsl/Ticketmain",
  "description": "Ticketmain is a passion project that I created to help my mother buy tickets for her favourite band, [The Killers](https://open.spotify.com/artist/0C0XlULifJtAgn6ZNCW2eu). As a developer, I decided to try and automate the process by creating a Chrome extension. I teamed up with my friend, [Wouter de Bruijn](http://wouterdebruijn.nl/), and we created Ticketmain, a Chrome extension that automatically refreshes the Ticketswap page to look for new tickets.\n\nThe extension is customizable, allowing users to set a minimum and maximum number of tickets, a price range, and a refresh rate. The project was written in plain HTML, JS, and CSS, making it a simple and quick solution to automate the ticket buying process.\n\nAlthough Ticketswap has since changed their HTML structure, causing the extension to be currently broken, I am open to dusting off the codebase and getting it up and running again if my mother needs it. In the future, I would spend more time on the project configuration to save development time. I’d much prefer the extension to be written in [Vue 3](https://vuejs.org/) instead of plain HTML, JS and CSS.\n\nOverall, creating Ticketmain was an interesting and exciting project, as it gave me the opportunity to work on something new and unique. It was my first time building a browser extension, and I once again want to thank Wouter de Bruijn for coming in clutch.",
  "short": "Ticketmain is a Chrome extension created to help automate the ticket buying process. Written in HTML, JS, and CSS, it allows users to customise settings like minimum/maximum tickets, price range, and refresh rate. Although currently broken due to changes in Ticketswap's HTML structure."
}