{
  "technologies": [
    "react",
    "next",
    "typescript",
    "deno",
    "supabase",
    "cloudconvert-api",
    "scss"
  ],
  "slug": "presently",
  "intro": "A display software for schools to upload and display PowerPoints, running on Raspberry Pi with a frontend built using the IBM Carbon System and Next.js, and backend using Supabase and CloudConvert.",
  "tagline": "Affordable narrowcasting screens that actually work!",
  "title": "Presently",
  "images": [
    {
      "image": {
        "src": "/content/project/images/presently-1.jpg",
        "alt": "Presently's login page."
      }
    },
    {
      "image": {
        "src": "/content/project/images/presently-2.jpg",
        "alt": "Presently's home page."
      }
    },
    {
      "image": {
        "src": "/content/project/images/presently-3.jpg",
        "alt": "Presently's upload model."
      }
    },
    {
      "image": {
        "src": "/content/project/images/presently-4.jpg",
        "alt": "Presently's file uploading model."
      }
    },
    {
      "image": {
        "alt": "Presently's file converting model.",
        "src": "/content/project/images/presently-5.jpg"
      }
    },
    {
      "image": {
        "alt": "Presently's overview page.",
        "src": "/content/project/images/presently-6.jpg"
      }
    },
    {
      "image": {
        "alt": "Presently's cover upload side.",
        "src": "/content/project/images/presently-7.jpg"
      }
    }
  ],
  "content": "My mother, who runs an [international primary school](https://www.optimist-international-school.nl/), wanted to install a TV in the hallway to keep parents and students informed about school-related information. She had approached a few services, but they all turned out to be too expensive. So, she asked me if I could develop software to run on the screen that would allow her to upload PowerPoints. I teamed up with [Wouter de Bruijn](http://wouterdebruijn.nl/), who developed a [Nuxt](https://nuxtjs.org/) frontend for the software while I focused on creating a [Node](https://nodejs.org/en/) application that ran on Windows to control PowerPoint.\n\nWe set up the software for my mother, and everything seemed great on the first day. However, running PowerPoint on Windows proved to be quite unstable, with frequent pop-ups and update requests. To address this, I rewrote the application in [.NET](https://dotnet.microsoft.com/en-us/) with C#, which allowed me to tap into the PowerPoint API and stabilize the software somewhat. However, I wasn't satisfied with the solution yet.\n\nAfter yet another rewrite, I settled on a system where PowerPoints get uploaded to [Supabase](https://supabase.com/), and then converted to a series of images using [CloudConvert](/). The displays in the school run a stripped-down version of [Raspbian](https://www.raspbian.org/), with a [Deno](https://deno.com/) application that downloads and displays the slides. The front end is written with the [IBM Carbon System](https://carbondesignsystem.com/) and [Next](https://nextjs.org/), using Supabase for storage, database, authentication, and edge functions. I should once again thank Wouter de Bruijn for setting up the stripped-down Raspbian, configuring the Raspberry Pi's, and managing the VPNs.\n\nPresently allows you to upload, delete, and replay PowerPoints on all or specific displays with a customized interval, pause/play functionality, and live preview. I'm very proud of what I've created. This project has taught me a lot about managing expenses, project planning, and time management. Once I complete the front end, I hope to start selling Presently as a service to small businesses. It is currently being used for its intended purpose at [Optimist International School](https://www.optimist-international-school.nl/).",
  "links": [
    {
      "url": "https://presently.dev/",
      "icon": "globe",
      "title": "View the website"
    }
  ],
  "bunny": "09402eca-0495-4f9e-a555-a67a37319eed",
  "image": {
    "alt": "Presently's landing page.",
    "src": "/content/project/images/presently-cover.png"
  },
  "categories": ["design", "development"]
}
