{
  "bunny": "d6040881-b684-444f-83cf-ee53b8045ce8",
  "technologies": [
    "deno",
    "expo",
    "figma",
    "next",
    "openai-api",
    "react-native",
    "react",
    "scss",
    "supabase"
  ],
  "slug": "swiftbite",
  "intro": "Swiftbite is my latest project, a food-tracking app researched, designed, and developed by me using Figma, Expo, Supabase, Next, AI-agents, and lots of APIs.",
  "tagline": "I prefer not to think about the number of tokens that have been burned",
  "title": "Swiftbite",
  "images": [
    {
      "image": {
        "alt": "Overworked App Stores page.",
        "src": "/content/project/images/swiftbite-1.png"
      }
    }
  ],
  "content": "For my scriptie at CMD I had to pick a project to research, design, and prototype. I landed on the idea of creating a food-tracking app, as I felt that the existing solutions fell short on very obvious problems. So I researched the target demographic, using methods like interviews, card sorting, diary & probes, competitor analysis, desk research, trend analysis, and much more.\n\nWith this information I moved on to the design phase, where I created Lo-Fi, Mi-Fi, and Hi-Fi designs in Figma to test with users. Although CMD doesn't require you to actually program, I already had a background in development, so I went the extra mile and implemented the app using Expo and built the back-end using Supabase and Next. I ended up getting a 9 for my entire project.\n\n> I had a very tight deadline for developing the app, so I focused only on iOS since I could run it on my own phone, and I knew one of the beoordelaars had an iPhone, so they'd be able to try it. I think you can guess how the rest went. I added more and more features, and now it's a lot more work to get the Android version working. It's a high priority for me, so I hope to release the Android version soon-ish™.\n\nAfter I finished my studies I continued working on Swiftbite to really make it a usable app, and at the time of writing I'm still working on it. I've improved and debugged a lot of features, and also started implementing AI agents and scrapers to keep the database clean. I hope to split this into its own microservice, like I did for Swiftbite Icons, as I feel that getting the database right is the hardest problem.\n\nFor now I'm focusing on the Dutch market because it's quite complicated to get the language, measurement system, and the database right. I've already burned a lot of tokens and compute power setting up the Dutch database, so switching to worldwide would cost a lot more compute and time on my part. Right now I'm focusing on improving the UX.",
  "links": [
    {
      "url": "https://apps.apple.com/nl/app/swiftbite/id6744180873",
      "icon": "app-store",
      "title": "View the app on the App Store"
    }
  ],
  "image": {
    "alt": "Overworked Play Store pages.",
    "src": "/content/project/images/swiftbite-1.png"
  },
  "categories": [
    "design",
    "development",
    "design"
  ]
}
