{
  "bunny": "2c890d31-a4f4-4e1e-8bf7-76ac9b29d5fa",
  "technologies": [
    "next",
    "openai-api",
    "react",
    "scss",
    "supabase",
    "typescript"
  ],
  "slug": "swiftbite-icons",
  "intro": "An easy-to-use API that allows users and companies to easily add consistent and good-looking food icons to their platforms or apps, battle-tested in my own app, Swiftbite!",
  "tagline": "Another microservice couldn't hurt right..?",
  "title": "Swiftbite Icons",
  "images": [
    {
      "image": {
        "alt": "Swiftbite Icons App Stores page.",
        "src": "/content/project/images/swiftbite-icons-1.png"
      }
    }
  ],
  "content": "After I finished my studies and continued work on [Swiftbite](https://sjorsvanholst.nl/project/swiftbite), I was looking through the user feedback and noticed that a lot of users were very impressed with the icon set the app contained. I was glad to hear this, of course, as I had spent quite a lot of time setting this up.\n\n> When I first created the icon flow for Swiftbite, the image generation models were way worse. So, I had to run a Docker container with an image processing pipeline and validation of the icons to ensure they looked good, which required a lot of work to set up. During my assignment, OpenAI released GPT-image-1, which made this whole pipeline redundant as it generated natively transparent images at very high quality.\n\nI figured other food-tracking apps or services might want to add something similar. The setup I created wouldn't be very hard to recreate for another service, but generating all the icons I already had does cost some money, so I thought I might as well make it available to other people. This way, they only had to add an img tag with the right URLs, and they'd be off to the races.\n\nSo, I turned the icon logic of Swiftbite into a standalone microservice. I created a landing page with some examples, a demo, and very simple API documentation. For now, I consider the service to be in beta, so to obtain an API key, users can contact me and I will provide it!",
  "links": [
    {
      "url": "https://icons.swiftbite.app",
      "icon": "globe",
      "title": "View the website"
    }
  ],
  "image": {
    "alt": "Overworked Play Store pages.",
    "src": "/content/project/images/swiftbite-icons-1.png"
  },
  "categories": ["design", "development"]
}
