{
  "slug": "toolenburgerplas",
  "intro": "The ZonneVeranda website, which I designed, effectively presents their solar energy solutions through a user-friendly and visually appealing interface. It highlights key products like the solar-equipped PowerPort and various installations for enhancing residential spaces sustainably.",
  "tagline": "Swim!",
  "title": "Toolenburgerplas",
  "images": [
    {
      "image": {
        "alt": "Test",
        "src": "/content/project/images/toolenburgerplas-cover.png"
      }
    },
    {
      "image": {
        "alt": "Test",
        "src": "/content/project/images/toolenburgerplas-1.png"
      }
    }
  ],
  "content": "I often go swimming with [Wouter de Bruijn](https://wouterdebruijn.nl/) in a local lake near our homes called [Toolenburgerplas](https://toolenburgerplas.nl/). For years, Wouter and I have been thinking about creating a website to show the water temperature and whether or not it’s comfortable for swimming.\n\nThis year, we finally created a temperature sensor. It consists of a 3D-printed enclosure with an antenna, Arduino 3G, internal and external temperature sensors, and batteries with a wireless charging circuit, ensuring we can charge it while underwater. This device, called ‘The Buoy,’ is installed in the Toolenburgerplas.\n\nI then created the website, which receives hourly data about the temperature. I use [OpenAI API](https://platform.openai.com) and [OpenWeather’s API](https://openweathermap.org/api) to generate a short summary of the current swimming conditions. I’ve designed variants for the ‘No’ and ‘Yes’ pages with different doodles and colors to reflect the weather.\n\nWouter connected and programmed the electronics, while we both worked on the enclosure. I created the website using [Next](https://nextjs.org/), [SCSS](https://sass-lang.com/), [TypeScript](https://www.typescriptlang.org/), and [Supabase](https://supabase.com/) for the database and edge functions. I’ve also used the aforementioned APIs to create the website. Working on this project took a while as I’m unfamiliar with hardware production, but I’m very happy and proud of the results!",
  "video": "/videos/toolenburgerplas-min.mp4?v=25df4305",
  "image": {
    "alt": "Test",
    "src": "/content/project/images/toolenburgerplas-cover.png"
  },
  "categories": [
    {
      "category": "Design"
    },
    {
      "category": "Development"
    }
  ]
}
